# Core
# Some dev tools required by other tools
brew "pkg-config"
brew "zsh-autosuggestions"

# CLI
brew "htop"
brew "telnet"
brew "ripgrep"
brew "bat"
brew "eza"
brew "zoxide"
brew "starship"
brew "fzf"
brew "atuin"
brew "fd"
brew "tmux"
brew "neovim"
brew "helix"
brew "watchexec"
brew "hyperfine"
brew "gh"
brew "glow"
brew "rclone"
brew "gping"
brew "gitui"
brew "jq"
brew "mise"
brew "curlie" # Curl should be installed (CLI Developer Tools on macOS)

# Data Analisis
brew "csvlens"
brew "duckdb"

# Languages
brew "go"
brew "ruff"
brew "uv"

# GIS
brew "tippecanoe"
brew "osmium-tool"

cask "macfuse"
cask "iina"

