# Core
# Some dev tools required by other tools
brew "pkg-config"
brew "zsh-autosuggestions"

# CLI
brew "htop"
brew "btop"
brew "telnet"
brew "wget"
brew "ripgrep"
brew "eza"
brew "zoxide"
brew "starship"
brew "fzf"
brew "sk"
brew "atuin"
brew "fd"
brew "tmux"
brew "watchexec"
brew "hyperfine"
brew "wrk"
brew "gh"
brew "glow"
brew "rclone"
brew "gping"
brew "jq"
brew "yq"
brew "jd"
brew "htmlq"
brew "mise"
brew "mkcert"
brew "tokei"
brew "restic"
brew "age"
brew "scooter"
brew "croc"
brew "hurl"
brew "pandoc"
brew "mihomo"
brew "aria2"
brew "umputun/apps/spot"

# EDITOR
brew "helix"
brew "neovim"
brew "hexyl"
brew "bat"

# AI
brew "whisper-cpp"
cask "claude-code"
cask "codex"
brew "charmbracelet/tap/crush"
brew "umputun/apps/ralphex"

# GIT
brew "git"
brew "gitui"
brew "lazygit"
brew "git-filter-repo"
brew "prek"

# Data Analisis
brew "csvlens"
brew "duckdb"

# Python
brew "ruff"
brew "uv"
brew "ty"

# DB
brew "libpq"

# GIS
brew "tippecanoe"
brew "osmium-tool"

# Hardware
brew "arduino-cli"

# GO
brew "go"
brew "gopls"
brew "gofumpt"
brew "goreleaser"
brew "golangci-lint"
brew "golangci-lint-langserver"
brew "delve"

cask "macfuse"
cask "ghostty"
cask "iina"
cask "marta"
cask "wireshark-app"
cask "ungoogled-chromium"

